{
  "main": {
    "name":"Yusuf Yaz覺c覺",
    "description":"With a Bachelor's degree in Computer Engineering from Istanbul Technical University and ongoing pursuit of a Master's degree, I bring a strong academic foundation and a passion for continuous learning to my role as a software developer. My 6+ years of experience at Turkcell has allowed me to develop a versatile skillset, initially focusing on developing microservice applications on Java, Spring Boot, and Oracle, and later expanding to include Python. As a machine learning engineer, I have a proven track record of implementing and deploying machine learning models in a production environment using both Java and Python. I am dedicated to staying current with industry advancements and constantly improving my skillset to provide high-quality solutions.",
    "image":"profilepic.jpg",
    "bio":"Yusuf Yaz覺c覺, who is a graduate of Istanbul Technical University's Computer Engineering program, is currently pursuing a master's degree. He has been working as a software developer at Turkcell for over 6 years. In the early years, he worked on Java, Spring Boot, and Oracle technologies, and later started working with Python. As a machine learning engineer, he has successfully implemented and deployed machine learning models in a production environment using both Java and Python. He is passionate about keeping up with industry advancements and continuously improving his skills",
    "contactmessage":"Geliyor...",
    "email": "yusufyazici@outlook.com",
    "phone": "555-555-5555",
    "github":"https://github.com/quents",
    "linkedin": "https://www.linkedin.com/in/yzciyusuf/",
    "website": "http://www.yaziciyusuf.com",
    "resumedownload":"https://www.icloud.com/iclouddrive/0c4AsCkZAOOQWTxWcjx8EPFvw#CV%5Fof%5FYusuf%5FYazici",
    "social":[
      {
        "name":"twitter",
        "url":"https://twitter.com/yzciyusuf",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/yzciyusuf/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/quents",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"MLOps, Java, Python, DevOps",
    "education":[
      {
        "school":"Istanbul Technical University",
        "degree":"Computer Engineering (MSc)",
        "graduated":"Present",
        "description":"My Master's thesis focuses on the prediction of fraud detection in online transactions using machine learning. My interest in this field has allowed me to enhance my skills in the application of artificial intelligence and machine learning technologies as an experienced machine learning engineer."
      },
      {
        "school":"Istanbul Technical University",
        "degree":"Computer Engineering (BSc)",
        "graduated":"July 2016",
        "description":"Istanbul Technical University's Bachelor of Computer Engineering program equipped me with a strong foundation in software development, providing hands-on experience through various projects and practical coursework. During my time at university, I gained skills in a range of programming languages, algorithms, and software design methodologies, preparing me for a successful career in the field."
      }
    ],
    "work":[
      {
        "company":"Turkcell",
        "title":"Senior Machine Learning Engineer",
        "years":"May 2020 - Present",
        "description":"Since May 2020, I have been working as a machine learning engineer at Turkcell. During this time, I have been involved in various projects, including developing and serving the company's speech to text system (STT) and OCR (Optical Character Recognition) system. The STT system has acoustic and language models trained with Kaldi ASR (Automatic Speech Recognition) framework and served using Python FastAPI. The OCR system uses three different FastAPI webservice modules for preprocessing, text detection and recognition, with custom solutions developed for certain document types. I have utilized technologies such as Python and FastAPI, as well as Apache Kafka for data processing. Additionally, I have dockerized and deployed machine learning projects to the Openshift environment. My role involves working on both the development and deployment of these projects, and ensuring that they are efficient and effective."
      },
      {
        "company":"Turkcell",
        "title":"Software Engineer",
        "years":"July 2016 - May 2020",
        "description":"Between 2016 and 2020, I worked as a software developer at Turkcell Billing Development department. I developed scalable and horizontally extensible microservice applications with low response time using Java, Spring Boot, and Oracle database systems. My responsibilities included proposing solutions for the back-end of the Turkcell billing system using Java and PL-SQL, developing software using Oracle technologies, and creating web applications using Java technologies and REST architecture. I applied the Kanban Agile methodology on all projects, visualizing production and measuring cycle time. I utilized Jenkins for continuous integration and DevOps and was responsible for the entire deployment process, from code analysis to versioning the package and sending it to production."
      },
      {
        "company":"Veripark",
        "title":"Part-time Software Engineer",
        "years":"January 2016 - July 2020",
        "description":"I have been involved in full-stack web software development processes using .NET technologies."
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"70%"
      },
      {
        "name":"Java",
        "level":"65%"
      },
      {
        "name":"Kubernetes",
        "level":"60%"
      },
      {
        "name":"Microservices",
        "level":"65%"
      },
      {
        "name":"Relational Databases",
        "level":"70%"
      },
      {
        "name":"Spring Boot",
        "level":"60%"
      },
      {
        "name":"MLOps",
        "level":"60%"
      },
      {
        "name":"DevOps",
        "level":"60%"
      },
      {
        "name":"AWS",
        "level":"50%"
      }
    ],
    "project": [
      {
        "name":"Optical Character Recognition as a Service",
        "years": "2020 - Present",
        "description":"The Optical Character Recognition system developed for Turkcell is a collection of Python FastAPI microservices. The system includes several modules for image preprocessing, a neural network based text detection using Differentiable Binarization architecture, text recognition using CRNN, background segmentation, document classification, signature detection, preprocessing, and postprocessing, all aimed at improving OCR accuracy. As the leader of the project, I have been responsible for developing its key features and guiding the project's architecture. The next step is to make the system available as an on-premise service and potentially as a mobile SDK. The microservices are also containerized and deployed on the Kubernetes Openshift platform."
      },
      {
        "name":"Speech to Text as a Service",
        "years": "2020 - Present",
        "description":"The acoustic and language model is trained using the Kaldi ASR toolkit and served with Python FastAPI as a SaaS to make container orchestration easy and efficient. With the help of continuous integration processes and Openshift Kubernetes, STT language models for different needs can be easily deployed using only a single codebase. In addition to the core STT system, I was also responsible for two additional projects leveraging the STT technology. The first project involved the detection of inappropriate content in podcasts, utilizing the STT system to process the audio in real-time and make a callback to the client via a producer-consumer architecture using Kafka. The second project involved digital verification of new subscribers, where the STT system analyzed the voice as a web service and verified that the spoken text matched the subscription requirements. As a key contributor to this project, I was responsible for the successful implementation of these additional features."
      },
      {
        "name":"Recommendation Engines on online platforms",
        "years": "2020",
        "description":"This project involved the development of a recommendation system for various online platforms, leveraging user and item interactions data, which is then integrated into the HDFS Hadoop platform. The Alternating Least Squares (ALS) recommender model was developed using PySpark to generate recommendations based on user and item interactions. The recommendations generated by the model are item-item similarity scores and user-item recommendation scores, providing users with personalized suggestions to help them find items of interest. The purpose of the recommendation system is to improve the user experience on the platform and increase engagement by presenting relevant items to the user. The user item interactions data included information such as how often users interacted with certain items, what items were frequently purchased or viewed together, and other relevant behavior patterns. This data was analyzed and used to develop the recommendation model, which was designed to learn from user behavior and suggest items that are likely to be of interest to individual users based on their past interactions."
      },
      {
        "name":"Fraud Detection with Machine Learning on Online Transactions",
        "years": "2022 - Present",
        "description":"I am leading the development of a comprehensive fraud detection system for online transactions, including data collection, feature generation, exploratory data analysis, feature engineering, modeling, and MLOps. This cutting-edge project leverages state-of-the-art techniques to detect fraudulent activities in real-time, ensuring the security of online transactions and protecting against financial loss. Through my expertise in machine learning and experience in developing similar projects, I am equipped to bring the latest innovations and best practices to this project to ensure its success."
      },
      {
        "name":"Instant Revenue Calculator",
        "years": "2019 - 2020",
        "description":"As the lead developer of the Instant Revenue Calculator project, I designed and implemented a high-performance, real-time multi-threaded application using Java and utilizing a microservices architecture. I leveraged Apache Kafka for event processing, which enables the system to handle an impressive 15 million records each day with ease. The project also makes use of Spring Data JPA for data access, providing a robust and scalable solution for calculating revenue in real-time."
      },
      {
        "name":"Regulatory Rule Monitoring",
        "years": "2018 - 2019",
        "description":"As a Lead Developer on the Regulatory Rule Monitoring project, I was responsible for implementing a cutting-edge task automation tool that facilitates compliance with industry regulations. The web-based platform, developed with Java Spring MVC and Hibernate, operates with a REST architecture to seamlessly connect the frontend and backend. Utilizing AngularJS for frontend development and Oracle PL/SQL for batch processing, RRM executes regulative controls on a daily, weekly, or monthly basis with a defined threshold, providing real-time regulatory compatibility rates through a user-friendly interface."
      }
  
    ],
    "certificate": [
      {
        "name":"Machine Learning Engineering Nanodegree",
        "years": "2018",
        "institute": "Udacity",
        "description":"I participated in the Machine Learning Engineering Nanodegree program by Udacity, a comprehensive and hands-on educational program that focuses on building real-world skills in machine learning. The program covers key topics such as supervised and unsupervised learning, deep learning, reinforcement learning, and more. Through a combination of interactive lessons, coding exercises, and projects, I developed a deep understanding of the latest machine learning techniques and methodologies. This experience has prepared me to apply my knowledge in real-world applications and further advance my career in the field of machine learning."
      },
      {
        "name":"Massachusetts Institute of Technology (MIT) Internet Of Things Bootcamp, Certificate of Completion",
        "years": "2017",
        "institute": "MIT",
        "description":"An intense bootcamp that lasted a week, where we, as a team built an IoT product and tried to convince the jury that what we created is the best. Developed a product named LockWolf that controls and manages access to dangerous and expensive equipment in makerspaces. Technically, it is a Raspberry Pi device that could read RFID cards, authorize the card owner and validate from the system that the owner scheduled an appointment to use the equipment. The technologies used: Raspberry Pi and its Python library, RFID equipment, AWS REST architecture to communicate with the backend server, and Google Calendar to manage the scheduling processes."
      
      },
      {
        "name":"Massachusetts Institute of Technology (MIT) - Turkcell Innovation & Leadership Bootcamp, Certificate in New Ventures Leadership with Distinction",
        "years": "2017",
        "institute": "MIT & Turkcell",
        "description":"I participated in the Massachusetts Institute of Technology Innovation & Leadership Bootcamp, a one-week intense program designed to equip individuals with the skills and knowledge necessary for innovation and leadership. The program, hosted by one of the world's leading universities in technology and innovation, provided a unique learning opportunity to enhance my abilities in these areas."
      }
  
    ]
  }
 
}
